#### Terraform Workspace - `production-eu`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
workspaces/production-eu relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructure/infrastructure/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructure/infrastructure

To view this run in a browser, visit:
https://app.terraform.io/app/kieranoneill/production-eu/runs/run-6BSFnKi4rtS2mGZH

Waiting for the plan to start...

Terraform v1.9.8
on linux_amd64
Initializing plugins and modules...
data.hcloud_ssh_key.default_ssh_key: Refreshing...
data.hcloud_ssh_key.default_ssh_key: Refresh complete after 1s [name=odin@gungnir]
module.voi_node.hcloud_server.node: Refreshing state... [id=55379167]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.voi_node.hcloud_server.node must be replaced
-/+ resource "hcloud_server" "node" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "nbg1-dc3" -> (known after apply)
      ~ firewall_ids               = [] -> (known after apply)
      ~ id                         = "55379167" -> (known after apply)
      ~ ipv4_address               = "167.235.147.50" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:1c0c:63c6::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:1c0c:63c6::/64" -> (known after apply)
        name                       = "voi-node-nbg1-ubuntu24.04-cx42"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 160 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "xFZtaUiSKTYj+mb35A6g6OSCG50=" -> "f2UWZXONYprWEJncbL7a7VxHMwY=" # forces replacement
        # (12 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kieranroneill, Action: `pull_request`, Working Directory: ``, Workflow: `Production - EU`*